---
kind: method
id: M:Autodesk.Revit.DB.ContentNode.GetAsset
source: html/a7312ace-8040-2e3b-b4e6-7447aa84a714.htm
---
# Autodesk.Revit.DB.ContentNode.GetAsset Method

Returns an an instance of an Asset object, which contains definitions of the content node.

## Syntax (C#)
```csharp
public Asset GetAsset()
```

## Remarks
Properties and attributes of the node can be accessed using the standard interface of the Asset class.